In [2]:
import pandas as pd
import numpy as np

# Series

In [3]:
labels = ['a','b','c']
data = [10,20,30]
my_arr = np.array(data)
dic = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data= my_arr, index= labels)

a    10
b    20
c    30
dtype: int32

In [5]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(labels,labels)

a    a
b    b
c    c
dtype: object

In [7]:
pd.Series(data= [sum,print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [8]:
ser1 = pd.Series([1,2,3,4], ['us','jpn','ind','pak'])
ser1

us     1
jpn    2
ind    3
pak    4
dtype: int64

In [9]:
ser2 = pd.Series([1,2,5,4],  ['us','jpn','rus','pak'])
ser2

us     1
jpn    2
rus    5
pak    4
dtype: int64

In [10]:
ser1 + ser2

ind    NaN
jpn    4.0
pak    8.0
rus    NaN
us     2.0
dtype: float64

In [11]:
ser1['ind']

3

# DataFrames

In [12]:
# to get same random numbers
np.random.seed(101)

In [13]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [15]:
type(df['Z'])

pandas.core.series.Series

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [19]:
df['new'] = np.random.randn(5,1)

In [20]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119
E  0.190794  1.978757  2.605967  0.683509 -0.134841

In [21]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
df.drop('E')

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [23]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [24]:
# for permanent remove from df use inplace
df.drop('new',axis=1, inplace=True)

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df.shape

(5, 4)

In [27]:
#Selecting Rows
df.loc[['A','C']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [28]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [29]:
df.loc['B','Y']

-0.84807698340363147

In [30]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.iloc[[2,3],[1,2]]

          X         Y
C  0.740122  0.528813
D -0.758872 -0.933237

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
bool_df= df>0
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [35]:
df[bool_df]
#or
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [37]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df[df['Z']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[df['Z']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [40]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
(df['W']>0) | (df['Y']>0)

A    True
B    True
C    True
D    True
E    True
dtype: bool

In [42]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [43]:
newind = " NY WC OR CO FL".split()
newind

['NY', 'WC', 'OR', 'CO', 'FL']

In [44]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     NY
B  0.651118 -0.319318 -0.848077  0.605965     WC
C -2.018168  0.740122  0.528813 -0.589001     OR
D  0.188695 -0.758872 -0.933237  0.955057     CO
E  0.190794  1.978757  2.605967  0.683509     FL

In [45]:
df.set_index('States')

               W         X         Y         Z
States
NY      2.706850  0.628133  0.907969  0.503826
WC      0.651118 -0.319318 -0.848077  0.605965
OR     -2.018168  0.740122  0.528813 -0.589001
CO      0.188695 -0.758872 -0.933237  0.955057
FL      0.190794  1.978757  2.605967  0.683509

In [46]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     NY
B  0.651118 -0.319318 -0.848077  0.605965     WC
C -2.018168  0.740122  0.528813 -0.589001     OR
D  0.188695 -0.758872 -0.933237  0.955057     CO
E  0.190794  1.978757  2.605967  0.683509     FL

### Multiindex and hierarchy

In [47]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [48]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [54]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  1.901755  0.238127
   2  1.996652 -0.993263
   3  0.196800 -1.136645
G2 1  0.000366  1.025984
   2 -0.156598 -0.031579
   3  0.649826  2.154846

In [55]:
df.index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [56]:
df.index.names

FrozenList([None, None])

In [57]:
df.index.names = ['Groups','num']

In [58]:
df.index.names

FrozenList(['Groups', 'num'])

In [59]:
df

                   A         B
Groups num
G1     1    1.901755  0.238127
       2    1.996652 -0.993263
       3    0.196800 -1.136645
G2     1    0.000366  1.025984
       2   -0.156598 -0.031579
       3    0.649826  2.154846

In [61]:
df.loc['G2']['B'][2]

-0.031579143908112575

In [62]:
df.loc['G1']

            A         B
num
1    1.901755  0.238127
2    1.996652 -0.993263
3    0.196800 -1.136645

In [63]:
# cross section index
df.xs(1, level = 'num')

               A         B
Groups
G1      1.901755  0.238127
G2      0.000366  1.025984

# Missing Data

In [64]:
dic  = {'A':[1,2,np.nan],'B':[4,np.nan,np.nan],'C':[2,3,6]}

In [65]:
df = pd.DataFrame(dic)
df

     A    B  C
0  1.0  4.0  2
1  2.0  NaN  3
2  NaN  NaN  6

In [66]:
df.dropna(axis=1)

   C
0  2
1  3
2  6

In [67]:
df.dropna(thresh=2)

     A    B  C
0  1.0  4.0  2
1  2.0  NaN  3

In [68]:
df.fillna(value = "FILL VALUE")

            A           B  C
0           1           4  2
1           2  FILL VALUE  3
2  FILL VALUE  FILL VALUE  6

In [69]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GroupBy

In [70]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [71]:
df = pd.DataFrame(data=data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [72]:
byComp = df.groupby('Company')

In [73]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [74]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [75]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [76]:
byComp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [77]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [78]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [79]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [80]:
byComp.describe().loc['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Operations

In [81]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [82]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [83]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [84]:
df['col2'].nunique()

3

In [85]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [86]:
def square(x):
    return x*x

In [87]:
df['col1'].apply(square)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [88]:
df['col2'].apply(lambda x:x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [89]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [90]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [91]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [92]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [93]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [94]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [95]:
df.pivot_table(values='col1' ,index= ['col2'], columns=['col3'])

col3  abc  def  ghi  xyz
col2
444   1.0  NaN  NaN  4.0
555   NaN  2.0  NaN  NaN
666   NaN  NaN  3.0  NaN

# Input and Output

In [96]:
df=pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [315]:
df.to_csv("My_out", index=False)

In [318]:
pd.read_csv("My_out")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [326]:
pd.read_excel('Excel_Sample.xlsx', sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [1]:
df.to_excel('New_Excel.xlsx', sheet_name='NewSheet')

NameError: name 'df' is not defined